yuplus/nxp-mcx-series/MCXA366/drivers/fsl_lpspi.c
        /* Check whether there is RX data in RX FIFO. Read out the RX data so that the RX FIFO would not overrun. */
        /*
         * $Branch Coverage Justification$
         * Data will be transferred in the inner loop until complete, after which the interrupt will end.(will improve)
         */
        if (((stateParams->rxData) != NULL) && ((stateParams->rxRemainingByteCount) != 0U)) /* GCOVR_EXCL_BR_LINE */
        {
#if SPI_RETRY_TIMES
            uint32_t waitTimes = SPI_RETRY_TIMES;
#endif
            /* To ensure parallel execution in 3-wire mode, after writting 1 to TXMSK to generate clock of
               bytesPerFrame's data wait until bytesPerFrame's data is received. */
            while ((stateParams->isTxMask) && (LPSPI_GetRxFifoCount(base) == 0U))
            {
#if SPI_RETRY_TIMES
                if (--waitTimes == 0U)
                {
                    return false;
                }
#endif
            }

#if SPI_RETRY_TIMES
            waitTimes = SPI_RETRY_TIMES;
            while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
            while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
            {
                readData = LPSPI_ReadData(base);
                /*
                 * $Branch Coverage Justification$
                 * rxRemainingByteCount must be an integer multiple of bytesEachRead, otherwise it cannot pass the check
                 * of #LPSPI_CheckTransferArgument,so it doesn't happen here.(will improve)
                 */
                if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead)) /* GCOVR_EXCL_BR_LINE */
                {
                    (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount); /* GCOVR_EXCL_LINE */
                }

                LPSPI_SeparateReadData((stateParams->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
                (stateParams->rxData) += (stateParams->bytesEachRead);

                (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
            }
#if SPI_RETRY_TIMES
            if (waitTimes == 0U)
            {
                return false;
            }
#endif
        }
    }
    return true;
}

static bool LPSPI_MasterTransferClearTCR(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams)
{
#if SPI_RETRY_TIMES
    uint32_t waitTimes = SPI_RETRY_TIMES;
    while ((LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base)) && (--waitTimes != 0U))
#else
    while (LPSPI_GetTxFifoCount(base) == LPSPI_GetRxFifoSize(base))
#endif
    {
    }
#if SPI_RETRY_TIMES
    if (waitTimes == 0U)
    {
        return false;
    }
#endif
    base->TCR = (LPSPI_GetTcr(base) & ~(LPSPI_TCR_CONTC_MASK | LPSPI_TCR_CONT_MASK));

    return true;
}

static bool LPSPI_MasterTransferReadDataInFifo(LPSPI_Type *base,
                                               lpspi_transfer_t *transfer,
                                               lpspi_transfer_blocking_param_t *stateParams)
{
    uint32_t readData;
    bool isByteSwap = ((transfer->configFlags & (uint32_t)kLPSPI_MasterByteSwap) != 0U);
    while ((stateParams->rxRemainingByteCount) > 0U)
    {
#if SPI_RETRY_TIMES
        uint32_t waitTimes = SPI_RETRY_TIMES;
        while ((LPSPI_GetRxFifoCount(base) != 0U) && (--waitTimes != 0U))
#else
        while (LPSPI_GetRxFifoCount(base) != 0U)
#endif
        {
            readData = LPSPI_ReadData(base);

            if ((stateParams->rxRemainingByteCount) < (stateParams->bytesEachRead))
            {
                (stateParams->bytesEachRead) = (uint8_t)(stateParams->rxRemainingByteCount);
            }

            LPSPI_SeparateReadData((stateParams->rxData), readData, (stateParams->bytesEachRead), isByteSwap);
            (stateParams->rxData) += (stateParams->bytesEachRead);

            (stateParams->rxRemainingByteCount) -= (stateParams->bytesEachRead);
        }
#if SPI_RETRY_TIMES
        if (waitTimes == 0U)
        {
            return false;
        }
#endif
    }

    return true;
}

static bool LPSPI_MasterTransferReadDataInFifoNoBuf(LPSPI_Type *base, lpspi_transfer_blocking_param_t *stateParams)
{
#if SPI_RETRY_TIMES
    uint32_t waitTimes = SPI_RETRY_TIMES;
    while (((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_TransferCompleteFlag) == 0U) && (--waitTimes != 0U))
#else
    while ((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_TransferCompleteFlag) == 0U)
#endif
    {
    }
#if SPI_RETRY_TIMES
    if (waitTimes == 0U)
    {
        return false;
    }
#endif
    return true;
}

/*!
 * brief LPSPI master transfer data using a polling method.
 *
 * This function transfers data using a polling method. This is a blocking function, which does not return until all
 * transfers have been completed.
 *
 * Note:
 * The transfer data size should be integer multiples of bytesPerFrame if bytesPerFrame is less than or equal to 4.
 * For bytesPerFrame greater than 4:
 * The transfer data size should be equal to bytesPerFrame if the bytesPerFrame is not integer multiples of 4.
 * Otherwise, the transfer data size can be an integer multiple of bytesPerFrame.
 *
 * param base LPSPI peripheral address.
 * param transfer pointer to lpspi_transfer_t structure.
 * return status of status_t.
 */
status_t LPSPI_MasterTransferBlocking(LPSPI_Type *base, lpspi_transfer_t *transfer)
{
    assert(transfer != NULL);

    /* Check that LPSPI is not busy.*/
    if ((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_ModuleBusyFlag) != 0U)
    {
        return kStatus_LPSPI_Busy;
    }

    /* Check the SR[MBF] again - workaround for ERR010655 */
    /*
     * $Branch Coverage Justification$
     * Depends on errata.
     */
    if ((LPSPI_GetStatusFlags(base) & (uint32_t)kLPSPI_ModuleBusyFlag) != 0U) /* GCOVR_EXCL_BR_LINE */
    {
        return kStatus_LPSPI_Busy; /* GCOVR_EXCL_LINE */
    }

    LPSPI_Enable(base, false);
    /* Check arguements */
    if (!LPSPI_CheckTransferArgument(base, transfer, false))
    {
        return kStatus_InvalidArgument;
    }

    LPSPI_FlushFifo(base, true, true);
    LPSPI_ClearStatusFlags(base, (uint32_t)kLPSPI_AllStatusFlag);

    /* Variables */
    uint32_t whichPcs = (transfer->configFlags & LPSPI_MASTER_PCS_MASK) >> LPSPI_MASTER_PCS_SHIFT;
#if !(defined(FSL_FEATURE_LPSPI_HAS_NO_MULTI_WIDTH) && FSL_FEATURE_LPSPI_HAS_NO_MULTI_WIDTH)
    uint32_t width    = (transfer->configFlags & LPSPI_MASTER_WIDTH_MASK) >> LPSPI_MASTER_WIDTH_SHIFT;
#endif
    uint32_t temp     = (base->CFGR1 & LPSPI_CFGR1_PINCFG_MASK);
    lpspi_transfer_blocking_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

