yuplus/nxp-mcx-series/MCXA366/drivers/fsl_lpspi.c
    stateParams.txData               = transfer->txData;
    stateParams.rxData               = transfer->rxData;
    stateParams.isTxMask             = false;
    stateParams.rxRemainingByteCount = transfer->dataSize;

    /* Backup frame size */
    uint32_t frame_size     = (LPSPI_GetTcr(base) & LPSPI_TCR_FRAMESZ_MASK) >> LPSPI_TCR_FRAMESZ_SHIFT;
    uint32_t frame_size_new = frame_size;
    uint32_t bytesPerFrame  = (frame_size / 8U) + 1U;

    /* No need to configure PCS continous if the transfer byte count is smaller than frame size */
    stateParams.isPcsContinuous = (((transfer->configFlags & (uint32_t)kLPSPI_MasterPcsContinuous) != 0U) &&
                                   (bytesPerFrame < transfer->dataSize));

    /* Mask tx data in half duplex mode */
    if (((temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdiInSdiOut)) || (temp == LPSPI_CFGR1_PINCFG(kLPSPI_SdoInSdoOut))) &&
        (stateParams.txData == NULL))
    {
        stateParams.isTxMask = true;
        if (stateParams.isPcsContinuous && (bytesPerFrame > 4U))
        {
            /* Workaround for ERR050607 */
            frame_size_new = 31U;
        }
    }

    base->CFGR1 &= (~LPSPI_CFGR1_NOSTALL_MASK);
    LPSPI_Enable(base, true);

    /* Configure transfer control register. */
    base->TCR = (LPSPI_GetTcr(base) & ~(LPSPI_TCR_CONT_MASK | LPSPI_TCR_CONTC_MASK | LPSPI_TCR_RXMSK_MASK |
                                        LPSPI_TCR_TXMSK_MASK | LPSPI_TCR_PCS_MASK
#if !(defined(FSL_FEATURE_LPSPI_HAS_NO_MULTI_WIDTH) && FSL_FEATURE_LPSPI_HAS_NO_MULTI_WIDTH)
                                        | LPSPI_TCR_WIDTH_MASK)) | LPSPI_TCR_WIDTH(width) |
#else
                                        )) |
#endif
                LPSPI_TCR_PCS(whichPcs);

    /*TCR is also shared the FIFO, so wait for TCR written.*/
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_2$
     */
    if (!LPSPI_WaitTxFifoEmpty(base)) /* GCOVR_EXCL_BR_LINE */
    {
        return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
    }

    /* PCS should be configured separately from the other bits, otherwise it will not take effect. */
    base->TCR = (LPSPI_GetTcr(base) & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_CONT(stateParams.isPcsContinuous) |
                LPSPI_TCR_CONTC(stateParams.isPcsContinuous) | LPSPI_TCR_RXMSK(NULL == stateParams.rxData) |
                LPSPI_TCR_FRAMESZ(frame_size_new);

    /*TCR is also shared the FIFO, so wait for TCR written.*/
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_2$
     */
    if (!LPSPI_WaitTxFifoEmpty(base)) /* GCOVR_EXCL_BR_LINE */
    {
        return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
    }

    if (bytesPerFrame <= 4U)
    {
        stateParams.bytesEachWrite = (uint8_t)bytesPerFrame;
        stateParams.bytesEachRead  = (uint8_t)bytesPerFrame;
    }
    else
    {
        stateParams.bytesEachWrite = 4U;
        stateParams.bytesEachRead  = 4U;
    }

    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_2$
     */
    if (false == LPSPI_MasterTransferWriteAllTxData(base, transfer, &stateParams)) /* GCOVR_EXCL_BR_LINE */
    {
        return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
    }

    if (stateParams.isPcsContinuous && !stateParams.isTxMask)
    {
        /* In PCS continous mode(TCR[CONT]), after write all the data in TX FIFO, TCR[CONTC] and TCR[CONT] should be
           cleared to de-assert the PCS. Note that TCR register also use the TX FIFO. Also CONTC should be cleared when
           tx is not masked, otherwise written to TCR register with TXMSK bit set will initiate a new transfer. */
        /*
         * $Branch Coverage Justification$
         * $ref fsl_lpspi_c_ref_2$
         */
        if (false == LPSPI_MasterTransferClearTCR(base, &stateParams)) /* GCOVR_EXCL_BR_LINE */
        {
            return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
        }
    }

    /*Read out the RX data in FIFO*/
    if (stateParams.rxData != NULL)
    {
        /*
         * $Branch Coverage Justification$
         * $ref fsl_lpspi_c_ref_2$
         */
        if (false == LPSPI_MasterTransferReadDataInFifo(base, transfer, &stateParams)) /* GCOVR_EXCL_BR_LINE */
        {
            return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
        }
    }
    else
    {
        /* If no RX buffer, then transfer is not complete until transfer complete flag sets */
        /*
         * $Branch Coverage Justification$
         * $ref fsl_lpspi_c_ref_2$
         */
        if (false == LPSPI_MasterTransferReadDataInFifoNoBuf(base, &stateParams)) /* GCOVR_EXCL_BR_LINE */
        {
            return kStatus_LPSPI_Timeout; /* GCOVR_EXCL_LINE */
        }
    }

    /* Restore frame size */
    if (frame_size != frame_size_new)
    {
        base->TCR = (LPSPI_GetTcr(base) & ~LPSPI_TCR_FRAMESZ_MASK) | LPSPI_TCR_FRAMESZ(frame_size);
    }

    return kStatus_Success;
}

/*!
 * brief LPSPI master transfer data using an interrupt method.
 *
 * This function transfers data using an interrupt method. This is a non-blocking function, which returns right away.
 * When all data is transferred, the callback function is called.
 *
 * Note:
 * The transfer data size should be integer multiples of bytesPerFrame if bytesPerFrame is less than or equal to 4.
 * For bytesPerFrame greater than 4:
 * The transfer data size should be equal to bytesPerFrame if the bytesPerFrame is not integer multiples of 4.
 * Otherwise, the transfer data size can be an integer multiple of bytesPerFrame.
 *
 * param base LPSPI peripheral address.
 * param handle pointer to lpspi_master_handle_t structure which stores the transfer state.
 * param transfer pointer to lpspi_transfer_t structure.
 * return status of status_t.
 */
status_t LPSPI_MasterTransferNonBlocking(LPSPI_Type *base, lpspi_master_handle_t *handle, lpspi_transfer_t *transfer)
{
    assert(handle != NULL);
    assert(transfer != NULL);

    /* Check that we're not busy.*/
    if (handle->state == (uint8_t)kLPSPI_Busy)
    {
        return kStatus_LPSPI_Busy;
    }

    LPSPI_Enable(base, false);
    /* Check arguements */
    if (!LPSPI_CheckTransferArgument(base, transfer, false))
    {
        return kStatus_InvalidArgument;
    }

    /* Flush FIFO, clear status, disable all the interrupts. */
    LPSPI_FlushFifo(base, true, true);
    LPSPI_ClearStatusFlags(base, (uint32_t)kLPSPI_AllStatusFlag);
    LPSPI_DisableInterrupts(base, (uint32_t)kLPSPI_AllInterruptEnable);

    /* Variables */
    bool isRxMask = false;
    handle->isTxMask = false;
    uint8_t txWatermark;
    uint8_t dummyData = g_lpspiDummyData[LPSPI_GetInstance(base)];
    uint32_t whichPcs = (transfer->configFlags & LPSPI_MASTER_PCS_MASK) >> LPSPI_MASTER_PCS_SHIFT;
    uint32_t temp     = (base->CFGR1 & LPSPI_CFGR1_PINCFG_MASK);

    /* Assign the original value for members of transfer handle. */
    handle->state                = (uint8_t)kLPSPI_Busy;
    handle->txData               = transfer->txData;
    handle->rxData               = transfer->rxData;
    handle->txRemainingByteCount = transfer->dataSize;
    handle->rxRemainingByteCount = transfer->dataSize;
    handle->totalByteCount       = transfer->dataSize;
    handle->writeTcrInIsr        = false;

    /* Backup frame size */
    handle->frameSize     = (LPSPI_GetTcr(base) & LPSPI_TCR_FRAMESZ_MASK) >> LPSPI_TCR_FRAMESZ_SHIFT;
    uint32_t frameSizeNew = handle->frameSize;
    handle->bytesPerFrame = (uint16_t)(handle->frameSize / 8U) + 1U;

    /* No need to configure PCS continous if the transfer byte count is smaller than frame size */
    bool isPcsContinuous = (((transfer->configFlags & (uint32_t)kLPSPI_MasterPcsContinuous) != 0U) &&
                            (transfer->dataSize > handle->bytesPerFrame));
    handle->writeRegRemainingTimes =
        (transfer->dataSize / (uint32_t)handle->bytesPerFrame) * (((uint32_t)handle->bytesPerFrame + 3U) / 4U);
    handle->readRegRemainingTimes = handle->writeRegRemainingTimes;
    handle->txBuffIfNull =
        ((uint32_t)dummyData) | ((uint32_t)dummyData << 8) | ((uint32_t)dummyData << 16) | ((uint32_t)dummyData << 24);
    /*The TX and RX FIFO sizes are always the same*/
    handle->fifoSize        = LPSPI_GetRxFifoSize(base);
    handle->isPcsContinuous = isPcsContinuous;
    handle->isByteSwap      = ((transfer->configFlags & (uint32_t)kLPSPI_MasterByteSwap) != 0U);
    /*Calculate the bytes for write/read the TX/RX register each time*/
    if (handle->bytesPerFrame <= 4U)
    {
        handle->bytesEachWrite = (uint8_t)handle->bytesPerFrame;
        handle->bytesEachRead  = (uint8_t)handle->bytesPerFrame;
    }
    else
    {
        handle->bytesEachWrite = 4U;
        handle->bytesEachRead  = 4U;
    }

    /*Set the RX and TX watermarks to reduce the ISR times.*/
    /*
     * $Branch Coverage Justification$
     * $ref fsl_lpspi_c_ref_3$
     */
    if (handle->fifoSize > 1U) /* GCOVR_EXCL_BR_LINE */
    {
        txWatermark         = 1U;
        handle->rxWatermark = handle->fifoSize - 2U;
    }
    else
    {
        txWatermark         = 0U; /* GCOVR_EXCL_LINE */
        handle->rxWatermark = 0U; /* GCOVR_EXCL_LINE */
    }
    LPSPI_SetFifoWatermarks(base, txWatermark, handle->rxWatermark);

